[Rainmeter]
Update=-1
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|单按钮，真是来之不易的一键即达。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.9.0

[Variables]
@Include1=#@#Global.ini

[Btn1_M1]
Meter=Image
MeasureName=MMBtn1Shadow


;"砰！哈哈哈——"
[Btn1]
Meter=Image
MeterStyle=styColor1 | BtnAni
X=#OperatorX#
Y=#OperatorY#
W=370
H=150
LeftMouseUpAction=#RelsAct##Button1Action#

[Btn1Dots]
Meter=Image
MeterStyle=Btn1
ImageName=#@#Images\Dots.png
LeftMouseUpAction=

[Btn1_BL]
Meter=Image
MeterStyle=Btn1
Group=aniBkLayer
LeftMouseUpAction=

[Btn1Icon]
Meter=Image
ImageName=#Button1Icon#
ImageTint=0,0,0,20
X=([Btn1:X]+210)
Y=([Btn1:H]*0.08+[Btn1:Y])
W=([Btn1:H]*0.84)
H=([Btn1:H]*0.84)

[Btn1Title]
Meter=String
MeterStyle=styTitle
FontSize=50
Text=#Button1Title#
X=([Btn1:X]+16)
Y=([Btn1:Y]+20)

[Btn1TextDesc]
Meter=String
MeterStyle=styText
FontColor=150,150,150,255
FontSize=24
Text=#Button1Desc#
X=8r
Y=-14R